In [2]:
import pandas as pd
import sqlite3

conn=sqlite3.connect('salary.db')

In [4]:
employees_df = pd.read_csv("data/employees.csv", parse_dates=["join_date", "resign_date"])
employees_df.head()

   employe_id  branch_id    salary  join_date resign_date
0           1          3   7500000 2018-08-23         NaT
1           7          1   7500000 2017-04-28         NaT
2           8          1  13000000 2017-04-28         NaT
3           9          1  13500000 2017-12-22  2020-10-14
4          10          1   9000000 2018-03-01  2020-12-20

In [17]:
timesheets_df = pd.read_csv("data/timesheets.csv", parse_dates=["date"])
timesheets_df.head()

   timesheet_id  employee_id       date   checkin  checkout
0      23907432           66 2019-08-21  08:13:31  17:05:02
1      23907433           22 2019-08-21  08:56:34  18:00:48
2      23907434           21 2019-08-21  09:45:08  18:24:06
3      23907435           63 2019-08-21  09:55:47       NaN
4      23907437           60 2019-08-21  09:56:05  17:31:08

timesheet_id             int64
employee_id              int64
date            datetime64[ns]
checkin                 object
checkout                object
dtype: object